{
    "es": {
      "PHOTO_MODAL_TITLE": "Cambiar foto de perfil",
      "PHOTO_MODAL_CURRENT": "Foto actual",
      "PHOTO_MODAL_NEW": "Nueva foto",
      "PHOTO_MODAL_DRAG_HERE": "Arrastra una imagen aquí",
      "PHOTO_MODAL_DROP_HERE": "Suelta la imagen aquí",
      "PHOTO_MODAL_SELECT_BUTTON": "Seleccionar imagen",
      "PHOTO_MODAL_DRAG_DROP_INFO": "O arrastra y suelta una imagen aquí",
      "PHOTO_MODAL_FILE_REQUIREMENTS": "Formatos permitidos: JPG, PNG, GIF. Tamaño máximo: 5MB",
      "PHOTO_MODAL_CANCEL": "Cancelar",
      "PHOTO_MODAL_SAVE": "Guardar cambios",
      "PHOTO_MODAL_ERROR_FORMAT": "Formato de archivo no válido. Por favor, sube una imagen JPG, PNG o GIF.",
      "PHOTO_MODAL_ERROR_SIZE": "La imagen es demasiado grande. El tamaño máximo es 5MB.",
      "PHOTO_MODAL_ERROR_SELECT": "Por favor, selecciona una imagen",
      "PHOTO_MODAL_ERROR_DEFAULT": "Error al subir la imagen. Por favor, inténtalo de nuevo.",
      "PHOTO_MODAL_SUCCESS_TITLE": "¡Foto actualizada!",
      "PHOTO_MODAL_SUCCESS_TEXT": "Tu foto de perfil ha sido actualizada correctamente",
      "PHOTO_MODAL_CONTINUE": "Continuar",
  
      "PRIVACY_MODAL_TITLE": "Política de Privacidad",
      "PRIVACY_MODAL_HEADER": "Política de Privacidad y Tratamiento de Datos Personales",
      "PRIVACY_MODAL_RESPONSIBLE_TITLE": "1. Responsable del tratamiento",
      "PRIVACY_MODAL_RESPONSIBLE_TEXT": "La Asociación de Protección Animal \"Montañita Adopta\" (en adelante, \"Montañita Adopta\"), con domicilio en La Montañita, Caqueta y CIF [NÚMERO], es el responsable del tratamiento de los datos personales que nos facilite a través de este formulario de contacto.",
      "PRIVACY_MODAL_PURPOSE_TITLE": "2. Finalidad del tratamiento",
      "PRIVACY_MODAL_PURPOSE_TEXT": "Los datos personales que nos proporcione serán tratados con la finalidad de atender las consultas que nos realice a través del formulario de contacto y, en su caso, gestionar los procesos de adopción o las actividades relacionadas con nuestra asociación en las que pueda estar interesado.",
      "PRIVACY_MODAL_LEGITIMATION_TITLE": "3. Legitimación",
      "PRIVACY_MODAL_LEGITIMATION_TEXT": "La base legal para el tratamiento de sus datos es su consentimiento, que nos otorga al marcar la casilla correspondiente y enviar el formulario de contacto.",
      "PRIVACY_MODAL_RECIPIENTS_TITLE": "4. Destinatarios",
      "PRIVACY_MODAL_RECIPIENTS_TEXT": "Sus datos no serán cedidos a terceros, salvo obligación legal o cuando sea necesario para la gestión de los procesos de adopción, en cuyo caso se le informará previamente.",
      "PRIVACY_MODAL_CONSERVATION_TITLE": "5. Conservación de los datos",
      "PRIVACY_MODAL_CONSERVATION_TEXT": "Sus datos se conservarán durante el tiempo necesario para atender su consulta y, en su caso, gestionar los procesos de adopción o las actividades relacionadas con nuestra asociación en las que pueda estar interesado.",
      "PRIVACY_MODAL_RIGHTS_TITLE": "6. Derechos",
      "PRIVACY_MODAL_RIGHTS_TEXT": "Tiene derecho a acceder, rectificar y suprimir sus datos, así como a ejercer otros derechos, como se explica en la información adicional.",
      "PRIVACY_MODAL_ADDITIONAL_TITLE": "7. Información adicional",
      "PRIVACY_MODAL_ADDITIONAL_TEXT": "Puede consultar la información adicional y detallada sobre Protección de Datos en nuestra política de privacidad completa disponible en nuestra página web.",
      "PRIVACY_MODAL_CLOSE": "Cerrar",
      "PRIVACY_MODAL_ACCEPT": "Aceptar",
  
      "THANKYOU_MODAL_TITLE": "¡Mensaje Enviado!",
      "THANKYOU_MODAL_HEADER": "¡Gracias por contactarnos!",
      "THANKYOU_MODAL_TEXT": "Hemos recibido tu mensaje correctamente. Nos pondremos en contacto contigo lo antes posible.",
      "THANKYOU_MODAL_CLOSE": "Cerrar",
      "THANKYOU_MODAL_HOME": "Volver al inicio"
    },
    "en": {
      "PHOTO_MODAL_TITLE": "Change Profile Picture",
      "PHOTO_MODAL_CURRENT": "Current Photo",
      "PHOTO_MODAL_NEW": "New Photo",
      "PHOTO_MODAL_DRAG_HERE": "Drag an image here",
      "PHOTO_MODAL_DROP_HERE": "Drop the image here",
      "PHOTO_MODAL_SELECT_BUTTON": "Select Image",
      "PHOTO_MODAL_DRAG_DROP_INFO": "Or drag and drop an image here",
      "PHOTO_MODAL_FILE_REQUIREMENTS": "Allowed formats: JPG, PNG, GIF. Maximum size: 5MB",
      "PHOTO_MODAL_CANCEL": "Cancel",
      "PHOTO_MODAL_SAVE": "Save Changes",
      "PHOTO_MODAL_ERROR_FORMAT": "Invalid file format. Please upload a JPG, PNG or GIF image.",
      "PHOTO_MODAL_ERROR_SIZE": "The image is too large. Maximum size is 5MB.",
      "PHOTO_MODAL_ERROR_SELECT": "Please select an image",
      "PHOTO_MODAL_ERROR_DEFAULT": "Error uploading the image. Please try again.",
      "PHOTO_MODAL_SUCCESS_TITLE": "Photo Updated!",
      "PHOTO_MODAL_SUCCESS_TEXT": "Your profile picture has been successfully updated",
      "PHOTO_MODAL_CONTINUE": "Continue",
  
      "PRIVACY_MODAL_TITLE": "Privacy Policy",
      "PRIVACY_MODAL_HEADER": "Privacy Policy and Personal Data Processing",
      "PRIVACY_MODAL_RESPONSIBLE_TITLE": "1. Data Controller",
      "PRIVACY_MODAL_RESPONSIBLE_TEXT": "The Animal Protection Association \"Montañita Adopta\" (hereinafter, \"Montañita Adopta\"), with headquarters in La Montañita, Caqueta and CIF [NUMBER], is responsible for processing the personal data you provide through this contact form.",
      "PRIVACY_MODAL_PURPOSE_TITLE": "2. Purpose of Processing",
      "PRIVACY_MODAL_PURPOSE_TEXT": "The personal data you provide will be processed for the purpose of addressing the inquiries you make through the contact form and, where appropriate, managing adoption processes or activities related to our association in which you may be interested.",
      "PRIVACY_MODAL_LEGITIMATION_TITLE": "3. Legal Basis",
      "PRIVACY_MODAL_LEGITIMATION_TEXT": "The legal basis for processing your data is your consent, which you grant us by checking the corresponding box and submitting the contact form.",
      "PRIVACY_MODAL_RECIPIENTS_TITLE": "4. Recipients",
      "PRIVACY_MODAL_RECIPIENTS_TEXT": "Your data will not be transferred to third parties, except for legal obligation or when necessary for the management of adoption processes, in which case you will be informed in advance.",
      "PRIVACY_MODAL_CONSERVATION_TITLE": "5. Data Retention",
      "PRIVACY_MODAL_CONSERVATION_TEXT": "Your data will be kept for the time necessary to address your inquiry and, where appropriate, manage the adoption processes or activities related to our association in which you may be interested.",
      "PRIVACY_MODAL_RIGHTS_TITLE": "6. Rights",
      "PRIVACY_MODAL_RIGHTS_TEXT": "You have the right to access, rectify and delete your data, as well as to exercise other rights, as explained in the additional information.",
      "PRIVACY_MODAL_ADDITIONAL_TITLE": "7. Additional Information",
      "PRIVACY_MODAL_ADDITIONAL_TEXT": "You can consult additional and detailed information on Data Protection in our complete privacy policy available on our website.",
      "PRIVACY_MODAL_CLOSE": "Close",
      "PRIVACY_MODAL_ACCEPT": "Accept",
  
      "THANKYOU_MODAL_TITLE": "Message Sent!",
      "THANKYOU_MODAL_HEADER": "Thank you for contacting us!",
      "THANKYOU_MODAL_TEXT": "We have received your message correctly. We will contact you as soon as possible.",
      "THANKYOU_MODAL_CLOSE": "Close",
      "THANKYOU_MODAL_HOME": "Back to Home"
    },
    "fr": {
      "PHOTO_MODAL_TITLE": "Changer la photo de profil",
      "PHOTO_MODAL_CURRENT": "Photo actuelle",
      "PHOTO_MODAL_NEW": "Nouvelle photo",
      "PHOTO_MODAL_DRAG_HERE": "Glissez une image ici",
      "PHOTO_MODAL_DROP_HERE": "Déposez l'image ici",
      "PHOTO_MODAL_SELECT_BUTTON": "Sélectionner une image",
      "PHOTO_MODAL_DRAG_DROP_INFO": "Ou glissez et déposez une image ici",
      "PHOTO_MODAL_FILE_REQUIREMENTS": "Formats autorisés: JPG, PNG, GIF. Taille maximale: 5MB",
      "PHOTO_MODAL_CANCEL": "Annuler",
      "PHOTO_MODAL_SAVE": "Enregistrer les modifications",
      "PHOTO_MODAL_ERROR_FORMAT": "Format de fichier invalide. Veuillez télécharger une image JPG, PNG ou GIF.",
      "PHOTO_MODAL_ERROR_SIZE": "L'image est trop grande. La taille maximale est de 5MB.",
      "PHOTO_MODAL_ERROR_SELECT": "Veuillez sélectionner une image",
      "PHOTO_MODAL_ERROR_DEFAULT": "Erreur lors du téléchargement de l'image. Veuillez réessayer.",
      "PHOTO_MODAL_SUCCESS_TITLE": "Photo mise à jour!",
      "PHOTO_MODAL_SUCCESS_TEXT": "Votre photo de profil a été mise à jour avec succès",
      "PHOTO_MODAL_CONTINUE": "Continuer",
  
      "PRIVACY_MODAL_TITLE": "Politique de Confidentialité",
      "PRIVACY_MODAL_HEADER": "Politique de Confidentialité et Traitement des Données Personnelles",
      "PRIVACY_MODAL_RESPONSIBLE_TITLE": "1. Responsable du traitement",
      "PRIVACY_MODAL_RESPONSIBLE_TEXT": "L'Association de Protection Animale \"Montañita Adopta\" (ci-après, \"Montañita Adopta\"), domiciliée à La Montañita, Caqueta et CIF [NUMÉRO], est responsable du traitement des données personnelles que vous nous fournissez via ce formulaire de contact.",
      "PRIVACY_MODAL_PURPOSE_TITLE": "2. Finalité du traitement",
      "PRIVACY_MODAL_PURPOSE_TEXT": "Les données personnelles que vous fournissez seront traitées dans le but de répondre aux demandes que vous faites via le formulaire de contact et, le cas échéant, de gérer les processus d'adoption ou les activités liées à notre association auxquelles vous pourriez être intéressé.",
      "PRIVACY_MODAL_LEGITIMATION_TITLE": "3. Légitimation",
      "PRIVACY_MODAL_LEGITIMATION_TEXT": "La base légale pour le traitement de vos données est votre consentement, que vous nous accordez en cochant la case correspondante et en soumettant le formulaire de contact.",
      "PRIVACY_MODAL_RECIPIENTS_TITLE": "4. Destinataires",
      "PRIVACY_MODAL_RECIPIENTS_TEXT": "Vos données ne seront pas cédées à des tiers, sauf obligation légale ou lorsque cela est nécessaire pour la gestion des processus d'adoption, auquel cas vous en serez informé au préalable.",
      "PRIVACY_MODAL_CONSERVATION_TITLE": "5. Conservation des données",
      "PRIVACY_MODAL_CONSERVATION_TEXT": "Vos données seront conservées pendant le temps nécessaire pour répondre à votre demande et, le cas échéant, gérer les processus d'adoption ou les activités liées à notre association auxquelles vous pourriez être intéressé.",
      "PRIVACY_MODAL_RIGHTS_TITLE": "6. Droits",
      "PRIVACY_MODAL_RIGHTS_TEXT": "Vous avez le droit d'accéder, de rectifier et de supprimer vos données, ainsi que d'exercer d'autres droits, comme expliqué dans les informations supplémentaires.",
      "PRIVACY_MODAL_ADDITIONAL_TITLE": "7. Informations supplémentaires",
      "PRIVACY_MODAL_ADDITIONAL_TEXT": "Vous pouvez consulter des informations supplémentaires et détaillées sur la Protection des Données dans notre politique de confidentialité complète disponible sur notre site web.",
      "PRIVACY_MODAL_CLOSE": "Fermer",
      "PRIVACY_MODAL_ACCEPT": "Accepter",
  
      "THANKYOU_MODAL_TITLE": "Message Envoyé!",
      "THANKYOU_MODAL_HEADER": "Merci de nous avoir contactés!",
      "THANKYOU_MODAL_TEXT": "Nous avons bien reçu votre message. Nous vous contacterons dès que possible.",
      "THANKYOU_MODAL_CLOSE": "Fermer",
      "THANKYOU_MODAL_HOME": "Retour à l'accueil"
    }
  }